# -*- coding: utf-8 -*-
from log import logger
import os


a=["北京","深圳","广州","南京","成都","东莞","重庆","苏州","郑州","上海","威海","石家庄","武汉","沈阳","西安","青岛","长沙","哈尔滨","长春","杭州","潍坊","厦门","佛山","大连","合肥","天津","绵阳","徐州","无锡","湘潭","株洲","宜昌","肇庆","昆明","洛阳","济南","贵阳","南宁","福州","咸阳","南阳","惠州","太原","常德","泉州","襄阳","宝鸡","中山","德阳","常州","南通","扬州","新乡","烟台","嘉兴","大庆","营口","呼和浩特","芜湖","唐山","遵义","乌鲁木齐","南昌","岳阳","四平","宿迁","廊坊","兰州","南充","宜宾","濮阳","保定","济宁","自贡","银川","宁波","焦作","安阳","西宁","珠海","开封","大同","昆山","伊斯坦布尔","常熟","忻州","伊犁","温州","永州","大理","淮北","晋中","菏泽","榆林","绍兴","新余"]
# logger.info("dddd")
# print(os.path.abspath("."))
cityies='北京,上海'
createcityies = cityies.split(',')
# for i in createcityies:
#     print(i)
for city in createcityies:
    if a.__contains__(city):
        print(city)

